
###################
# I/O constraints
###################

set_attribute -name PIN_NUMBER -value "77" -port ack_o

set_attribute -name PIN_NUMBER -value "3" -port {adr_i[0]}

set_attribute -name PIN_NUMBER -value "4" -port {adr_i[1]}

set_attribute -name PIN_NUMBER -value "5" -port {adr_i[2]}

set_attribute -name PIN_NUMBER -value "6" -port { adr_i[3] }

set_attribute -name PIN_NUMBER -value "7" -port { adr_i[4] }

set_attribute -name PIN_NUMBER -value "8" -port { adr_i[5] }

set_attribute -name PIN_NUMBER -value "10" -port { adr_i[6] }

set_attribute -name PIN_NUMBER -value "11" -port { adr_i[7] }

set_attribute -name PIN_NUMBER -value "12" -port { adr_i[8] }

set_attribute -name PIN_NUMBER -value "13" -port { adr_i[9] }

set_attribute -name PIN_NUMBER -value "179" -port { c_id_i[0] }

set_attribute -name PIN_NUMBER -value "180" -port { c_id_i[1] }

set_attribute -name PIN_NUMBER -value "181" -port { c_id_i[2] }

set_attribute -name PIN_NUMBER -value "182" -port { c_id_i[3] } 

set_attribute -name PIN_NUMBER -value "75" -port { cyc_i }

set_attribute -name PIN_NUMBER -value "205" -port { dat_i[0] }

set_attribute -name PIN_NUMBER -value "204" -port { dat_i[1] }

set_attribute -name PIN_NUMBER -value "203" -port { dat_i[2] }

set_attribute -name PIN_NUMBER -value "202" -port { dat_i[3] }

set_attribute -name PIN_NUMBER -value "201" -port { dat_i[4] }

set_attribute -name PIN_NUMBER -value "199" -port { dat_i[5] }

set_attribute -name PIN_NUMBER -value "198" -port { dat_i[6] }

set_attribute -name PIN_NUMBER -value "197" -port { dat_i[7] }

set_attribute -name PIN_NUMBER -value "196" -port { dat_i[8] }

set_attribute -name PIN_NUMBER -value "194" -port { dat_i[9] }

set_attribute -name PIN_NUMBER -value "193" -port { dat_i[10] }

set_attribute -name PIN_NUMBER -value "192" -port { dat_i[11] }

set_attribute -name PIN_NUMBER -value "191" -port { dat_i[12] }

set_attribute -name PIN_NUMBER -value "190" -port { dat_i[13] }

set_attribute -name PIN_NUMBER -value "189" -port { dat_i[14] }

set_attribute -name PIN_NUMBER -value "188" -port { dat_i[15] }

set_attribute -name PIN_NUMBER -value "48" -port { dat_o[0]  }

set_attribute -name PIN_NUMBER -value "49" -port { dat_o[1]  }

set_attribute -name PIN_NUMBER -value "55" -port { dat_o[2]  }

set_attribute -name PIN_NUMBER -value "56" -port { dat_o[3]  }

set_attribute -name PIN_NUMBER -value "57" -port { dat_o[4]  }

set_attribute -name PIN_NUMBER -value "58" -port { dat_o[5]  }

set_attribute -name PIN_NUMBER -value "59" -port { dat_o[6]  }

set_attribute -name PIN_NUMBER -value "60" -port { dat_o[7]  }

set_attribute -name PIN_NUMBER -value "61" -port { dat_o[8]  }

set_attribute -name PIN_NUMBER -value "63" -port { dat_o[9]  }

set_attribute -name PIN_NUMBER -value "64" -port { dat_o[10] }

set_attribute -name PIN_NUMBER -value "66" -port { dat_o[11] }

set_attribute -name PIN_NUMBER -value "68" -port { dat_o[12] }

set_attribute -name PIN_NUMBER -value "69" -port { dat_o[13] }

set_attribute -name PIN_NUMBER -value "70" -port { dat_o[14] }

set_attribute -name PIN_NUMBER -value "73" -port { dat_o[15] }

set_attribute -name PIN_NUMBER -value "118" -port { fd_rstn_o }

set_attribute -name PIN_NUMBER -value "129" -port { fd_txck_o }

set_attribute -name PIN_NUMBER -value "119" -port { fd_txena_o }

set_attribute -name PIN_NUMBER -value "128" -port { fd_txer_i }

set_attribute -name PIN_NUMBER -value "120" -port { fd_wdgn_i }

set_attribute -name PIN_NUMBER -value "121" -port { fd_rxcdn_i }

set_attribute -name PIN_NUMBER -value "127" -port { fd_rxd_i }

set_attribute -name PIN_NUMBER -value "131" -port { fd_txd_o }

set_attribute -name PIN_NUMBER -value "172" -port { m_id_i[0] }

set_attribute -name PIN_NUMBER -value "173" -port { m_id_i[1] }

set_attribute -name PIN_NUMBER -value "174" -port { m_id_i[2] }

set_attribute -name PIN_NUMBER -value "175" -port { m_id_i[3] }

set_attribute -name PIN_NUMBER -value "185" -port { nostat_i }

set_attribute -name PIN_NUMBER -value "166" -port { p3_lgth_i[0] }

set_attribute -name PIN_NUMBER -value "167" -port { p3_lgth_i[1] }

set_attribute -name PIN_NUMBER -value "168" -port { p3_lgth_i[2] }

set_attribute -name PIN_NUMBER -value "111" -port { rate_i[0] }

set_attribute -name PIN_NUMBER -value "112" -port { rate_i[1] }

set_attribute -name PIN_NUMBER -value "92" -port { rst_i }

set_attribute -name PIN_NUMBER -value "93" -port { rstin_i }

set_attribute -name PIN_NUMBER -value "94" -port { rston_o }

set_attribute -name PIN_NUMBER -value "176" -port { s_id_o[0] }

set_attribute -name PIN_NUMBER -value "177" -port { s_id_o[1] }

set_attribute -name PIN_NUMBER -value "184" -port { slone_i }

set_attribute -name PIN_NUMBER -value "76" -port { stb_i }

set_attribute -name PIN_NUMBER -value "149" -port { subs_i[0] }

set_attribute -name PIN_NUMBER -value "150" -port { subs_i[1] }

set_attribute -name PIN_NUMBER -value "151" -port { subs_i[2] }

set_attribute -name PIN_NUMBER -value "152" -port { subs_i[3] }

set_attribute -name PIN_NUMBER -value "153" -port { subs_i[4] }

set_attribute -name PIN_NUMBER -value "158" -port { subs_i[5] }

set_attribute -name PIN_NUMBER -value "159" -port { subs_i[6] }

set_attribute -name PIN_NUMBER -value "160" -port { subs_i[7] }

set_attribute -name PIN_NUMBER -value "136" -port { uclk_i }

set_attribute -name PIN_NUMBER -value "82" -port { var1_acc_i }

set_attribute -name PIN_NUMBER -value "83" -port { var1_rdy_o  }

set_attribute -name PIN_NUMBER -value "84" -port { var2_acc_i }

set_attribute -name PIN_NUMBER -value "86" -port { var2_rdy_o  }

set_attribute -name PIN_NUMBER -value "87" -port { var3_acc_i }

set_attribute -name PIN_NUMBER -value "90" -port { var3_rdy_o  }

set_attribute -name PIN_NUMBER -value "28" -port { wclk_i }

set_attribute -name PIN_NUMBER -value "74" -port { we_i }

set_attribute -name PIN_NUMBER -value "78" -port { u_cacer_o }

set_attribute -name PIN_NUMBER -value "79" -port { u_pacer_o }

set_attribute -name PIN_NUMBER -value "80" -port { r_tler_o }

set_attribute -name PIN_NUMBER -value "85" -port { r_fcser_o } 

set_attribute -name PIN_NUMBER -value "21" -port { rstpon_i }
 

###################
# Clocks
###################

create_clock { uclk_i } -name uclk_i -period 25.000000

create_clock { wclk_i } -name wclk_i -period 25.000000


###################
# Global Resources
###################

set_attribute -design rtl -name buffer_sig -value CLKBUF -net { uclk_i }

set_attribute -design rtl -name buffer_sig -value CLKBUF -net { wclk_i }

set_attribute -design rtl -name buffer_sig -value CLKINT -net { s_nfip_intern_rst }



###################
# Input delays
###################

set_input_delay 10.000 -clock uclk_i -add_delay  -design rtl  {dat_i(*) fd_rxd_i fd_txer_i fd_wdgn_i rstin_i var1_acc_i var2_acc_i var3_acc_i}

set_input_delay 17.000 -clock uclk_i -add_delay  -design rtl  {m_id_i(*) c_id_i(*)}

set_input_delay 10.000 -clock wclk_i -add_delay  -design rtl  {adr_i(*) cyc_i rst_i stb_i we_i}


###################
# Output delays
###################

set_output_delay 10.000 -clock uclk_i -add_delay  -design rtl  {dat_o(*) fd_rstn_o fd_txck_o fd_txd_o fd_txena_o r_fcser_o r_tler_o rston_o s_id_o(*) u_cacer_o u_pacer_o var1_rdy_o var2_rdy_o var3_rdy_o}

set_output_delay 17.000 -clock uclk_i -add_delay  -design rtl  {s_id_o(*)}

set_output_delay 10.000 -clock wclk_i -add_delay  -design rtl  {ack_o}