###################################################################################
# Mentor Graphics Corporation
#
###################################################################################

#################
# Attributes
#################
set_attribute -name buffer_sig -value "CLKBUF" -net uclk_i -design gatelevel 
set_attribute -name buffer_sig -value "CLKBUF" -net wclk_i -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net manual_uclk_i -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net manual_wclk_i -design gatelevel 
set_attribute -name lut_max_fanout -value "1000000" -net -type integer s_nfip_intern_rst_int -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_modgen_counter_s_filt_c_reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_modgen_counter_s_filt_c_reg_q(3) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_modgen_counter_s_filt_c_reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_modgen_counter_s_filt_c_reg_q(2) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_modgen_counter_s_filt_c_reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_modgen_counter_s_filt_c_reg_q(1) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_modgen_counter_s_filt_c_reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_modgen_counter_s_filt_c_reg_q(0) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance model_constr_decoder_modgen_counter_s_counter_reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_modgen_counter_s_counter_reg_q(1) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance model_constr_decoder_modgen_counter_s_counter_reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_modgen_counter_s_counter_reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_reg_s_fd_rxd_synch(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_reg_s_fd_rxd_filt_d1 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_reg_s_fd_rxd_filt -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_VAR3_RDY_generation_reg_var3_rdy_o -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_constr_id_dec_o(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_constr_id_dec_o(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_constr_id_dec_o(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_constr_id_dec_o(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_constr_id_dec_o(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_constr_id_dec_o(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_constr_id_dec_o(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_constr_id_dec_o(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_model_id_dec_o(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_model_id_dec_o(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_model_id_dec_o(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_model_id_dec_o(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_model_id_dec_o(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_model_id_dec_o(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_model_id_dec_o(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance model_constr_decoder_reg_model_id_dec_o(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance WISHBONE_controller_reg_wb_ack_prod_p_o -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_reg_s_fd_rxd_filt__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deglitcher_reg_s_fd_rxd_filt__repl1 -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net reset_unit/uclk_i -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net reset_unit/wb_clk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_s_rsti_synch(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(11) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(11)_dup_1 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(10)_dup_2 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(9)_dup_3 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(8)_dup_4 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(7)_dup_5 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(6)_dup_6 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(5)_dup_7 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(4)_dup_8 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(3)_dup_9 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(2)_dup_10 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(1)_dup_11 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_q(0)_dup_12 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_rstin_st(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_rstin_st(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_rstin_st(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_rstin_st(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_rstin_st(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_var_rst_st(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_var_rst_st(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_var_rst_st(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_var_rst_st(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/NOT_ix13044z50933 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/ix27226z40555 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_s_u_por_synch(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_var_rst_st(2)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance reset_unit/reg_var_rst_st(0)__repl0 -design gatelevel 

set_attribute -name NOBUFF -value "TRUE" -net JTAG_controller/uclk_i -design gatelevel 
set_attribute -name BUFFER_SIG -value "CLKINT" -net JTAG_controller/jc_tck_o -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(15) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(14) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(13) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(12) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(11) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_q(1) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_TCK_periods_counter_modgen_counter_counter_o_reg_q(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_TCK_periods_counter_modgen_counter_counter_o_reg_q(4) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_TCK_periods_counter_modgen_counter_counter_o_reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_TCK_periods_counter_modgen_counter_counter_o_reg_q(3) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_TCK_periods_counter_modgen_counter_counter_o_reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_TCK_periods_counter_modgen_counter_counter_o_reg_q(2) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_TCK_periods_counter_modgen_counter_counter_o_reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_TCK_periods_counter_modgen_counter_counter_o_reg_q(1) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_TCK_periods_counter_modgen_counter_counter_o_reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_TCK_periods_counter_modgen_counter_counter_o_reg_q(0) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(6) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(5) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(4) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(3) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(2) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(1) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/JC_bytes_counter_modgen_counter_counter_o_reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_jc_st(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_jc_st(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_jc_st(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_jc_st(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_s_tck -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_s_bytes_c_d1(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_s_bytes_c_d1(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_s_bytes_c_d1(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_s_bytes_c_d1(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_s_bytes_c_d1(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_s_bytes_c_d1(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_s_bytes_c_d1(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/reg_jc_tdo_byte_o(0) -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net JTAG_controller/Session_Timeout_Counter/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(11) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance JTAG_controller/Session_Timeout_Counter/reg_s_counter(12) -design gatelevel 


set_attribute -name NOBUFF -value "TRUE" -net engine_control/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(7)_dup_60 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(6)_dup_61 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(5)_dup_62 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(4)_dup_63 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(3)_dup_64 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(2)_dup_65 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(1)_dup_66 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(0)_dup_67 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_control_st(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_control_st(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_control_st(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_control_st(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_control_st(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_control_st(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_control_st(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_control_st(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_control_st(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_control_st(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_prod_or_cons(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var_aux(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var_aux(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var_aux(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var_aux(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var_aux(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var_aux(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var_aux(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var_aux(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var_aux(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_s_var(1)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(0)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(6)_dup_61__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(5)_dup_62__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(4)_dup_63__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(1)_dup_66__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/reg_q(0)_dup_67__repl0 -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net engine_control/Produced_Data_Length_Calculator/uclk_i -design gatelevel 

set_attribute -name NOBUFF -value "TRUE" -net engine_control/Session_Timeout_Counter/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(11) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(12) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(13) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(14) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(15) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(16) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(17) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(18) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(19) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Session_Timeout_Counter/reg_s_counter(20) -design gatelevel 

set_attribute -name NOBUFF -value "TRUE" -net engine_control/Turnaround_and_Silence_Time_Counter/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(11) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(12) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(13) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(14) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(15) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(16) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance engine_control/Turnaround_and_Silence_Time_Counter/reg_s_counter(17) -design gatelevel 


set_attribute -name NOBUFF -value "TRUE" -net Consumption_Consumption_Bytes_Processor/uclk_i -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net Consumption_Consumption_Bytes_Processor/wb_clk_i -design gatelevel 
set_attribute -name MEMORYFILE -value "" -instance -type string Consumption_Consumption_Bytes_Processor/Consumption_RAM_DualRam_A9D8DualClkRAM_R0C0 -design gatelevel 
set_attribute -name MEMORYFILE -value "" -instance -type string Consumption_Consumption_Bytes_Processor/Consumption_JTAG_RAM_DualRam_A9D8DualClkRAM_R0C0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/Consumption_JTAG_RAM_DualRam_A9D8DualClkRAM_R0C0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_s_cons_lgth_byte(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_s_cons_lgth_byte(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_s_cons_lgth_byte(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_s_cons_lgth_byte(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_s_cons_lgth_byte(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_s_cons_lgth_byte(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_s_cons_lgth_byte(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_s_cons_lgth_byte(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_pdu_byte_o(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_pdu_byte_o(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_pdu_byte_o(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_pdu_byte_o(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_pdu_byte_o(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_pdu_byte_o(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_pdu_byte_o(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_pdu_byte_o(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_ctrl_byte_o(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_ctrl_byte_o(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_ctrl_byte_o(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_ctrl_byte_o(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Bytes_Processor/reg_cons_ctrl_byte_o(0) -design gatelevel 

set_attribute -name NOBUFF -value "TRUE" -net Consumption_Consumption_Outcome/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Outcome/reg_s_cons_frame_ok_p -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Outcome/reg_nfip_status_r_tler_p_o -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Outcome/reg_var2_rdy_o -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Outcome/reg_var1_rdy_o -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Outcome/reg_s_assert_rston -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Outcome/reg_s_rst_nfip_and_fd -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Consumption_Consumption_Outcome/reg_jc_start_p_o -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_s_signif_edge_found -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_s_manch_clk_d1 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_s_bit_clk_d1 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_s_bit_clk -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_s_manch_clk -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_ix19025z21835 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/rx_signif_edge_window_o -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/ix19025z40558 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/ix35390z50931 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(9)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(8)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(7)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(6)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(5)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(4)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(3)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Oscillator/reg_q(1)__repl0 -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_rx_st(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_rx_st(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_rx_st(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_rx_st(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_rx_st(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_rx_st(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_byte(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_byte(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_sample_manch_bit_p_d1 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_byte_ready_p_d1 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_CRC_ok_p_found -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_CRC_ok_p_d -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(15) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(14) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(13) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(12) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(11) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_arriving_fes(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Incoming_Bits_Index_reg_s_counter(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Incoming_Bits_Index_reg_s_counter(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Incoming_Bits_Index_reg_s_counter(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Incoming_Bits_Index_reg_s_counter(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/CRC_Verification_reg_s_q(15) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/CRC_Verification_reg_s_q(14) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/CRC_Verification_reg_s_q(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/ix55916z64467 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/CRC_Verification_reg_s_q(15)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_s_byte_ready_p_d1__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_rx_st(4)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/reg_rx_st(4)__repl1 -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(11) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(12) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(13) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(14) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(15) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(16) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(17) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(18) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(19) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Receiver_FIELDRIVE_Receiver_Deserializer/Session_Timeout_Counter/reg_s_counter(20) -design gatelevel 


set_attribute -name NOBUFF -value "TRUE" -net Production_production_bytes_retriever/uclk_i -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net Production_production_bytes_retriever/wb_clk_i -design gatelevel 
set_attribute -name MEMORYFILE -value "" -instance -type string Production_production_bytes_retriever/Produced_Bytes_From_RAM_DualRam_A9D8DualClkRAM_R0C0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/Produced_Bytes_From_RAM_DualRam_A9D8DualClkRAM_R0C0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(15) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(14) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(13) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(12) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(11) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_bytes_retriever/reg_s_slone_bytes(0) -design gatelevel 

set_attribute -name NOBUFF -value "TRUE" -net Production_production_status_bytes_generator/uclk_i -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR1_RDY_modgen_counter_counter_o_reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR1_RDY_modgen_counter_counter_o_reg_q(3) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR1_RDY_modgen_counter_counter_o_reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR1_RDY_modgen_counter_counter_o_reg_q(2) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR1_RDY_modgen_counter_counter_o_reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR1_RDY_modgen_counter_counter_o_reg_q(1) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR1_RDY_modgen_counter_counter_o_reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR1_RDY_modgen_counter_counter_o_reg_q(0) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR2_RDY_modgen_counter_counter_o_reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR2_RDY_modgen_counter_counter_o_reg_q(3) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR2_RDY_modgen_counter_counter_o_reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR2_RDY_modgen_counter_counter_o_reg_q(2) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR2_RDY_modgen_counter_counter_o_reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR2_RDY_modgen_counter_counter_o_reg_q(1) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR2_RDY_modgen_counter_counter_o_reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR2_RDY_modgen_counter_counter_o_reg_q(0) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR3_RDY_modgen_counter_counter_o_reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR3_RDY_modgen_counter_counter_o_reg_q(3) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR3_RDY_modgen_counter_counter_o_reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR3_RDY_modgen_counter_counter_o_reg_q(2) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR3_RDY_modgen_counter_counter_o_reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR3_RDY_modgen_counter_counter_o_reg_q(1) -design gatelevel 
set_attribute -name no_enable_dff -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR3_RDY_modgen_counter_counter_o_reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/Extend_VAR3_RDY_modgen_counter_counter_o_reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_fd_txer_synch(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_fd_wdg_synch(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_var3_acc_synch(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_var2_acc_synch(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_var1_acc_synch(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_refreshment -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_nFIP_status_byte(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_nFIP_status_byte(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_nFIP_status_byte(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_nFIP_status_byte(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_nFIP_status_byte(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance Production_production_status_bytes_generator/reg_s_nFIP_status_byte(2) -design gatelevel 

set_attribute -name NOBUFF -value "TRUE" -net FIELDRIVE_Transmitter_tx_oscillator/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_s_tx_sched_p_buff(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_s_tx_sched_p_buff(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_s_tx_sched_p_buff(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_s_tx_sched_p_buff(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/modgen_or_218_ix22191z61046 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/ix22191z50932 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/ix863z49935 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_oscillator/reg_q(5)__repl0 -design gatelevel 

set_attribute -name NOBUFF -value "TRUE" -net FIELDRIVE_Transmitter_tx_serializer/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_tx_st(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_tx_st(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_tx_st(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_tx_st(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_tx_st(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_tx_st(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_tx_st(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_s_data_byte(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_s_data_byte(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_s_data_byte(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_s_data_byte(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_s_data_byte(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_s_data_byte(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_s_data_byte(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_s_data_byte(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(15) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(14) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(13) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(12) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(11) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Outgoing_Bits_Index_reg_s_counter(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Outgoing_Bits_Index_reg_s_counter(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Outgoing_Bits_Index_reg_s_counter(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Outgoing_Bits_Index_reg_s_counter(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Outgoing_Bits_Index_reg_s_counter(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/crc_generation_reg_s_q(15)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/reg_s_txd__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Outgoing_Bits_Index_reg_s_counter(3)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Outgoing_Bits_Index_reg_s_counter(3)__repl1 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Outgoing_Bits_Index_reg_s_counter(1)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Outgoing_Bits_Index_reg_s_counter(0)__repl0 -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Outgoing_Bits_Index_reg_s_counter(0)__repl1 -design gatelevel 
set_attribute -name NOBUFF -value "TRUE" -net FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/uclk_i -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(0) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(1) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(2) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(3) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(4) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(5) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(6) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(7) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(8) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(9) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(10) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(11) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(12) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(13) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(14) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(15) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(16) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(17) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(18) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(19) -design gatelevel 
set_attribute -name insert_voter -value "TRUE" -instance FIELDRIVE_Transmitter_tx_serializer/Session_Timeout_Counter/reg_s_counter(20) -design gatelevel 




##################
# Clocks
##################
create_clock { uclk_i } -name uclk_i -period 25.000000 -waveform { 0.000000 12.500000 } -design gatelevel 
create_clock { wclk_i } -name wclk_i -period 25.000000 -waveform { 0.000000 12.500000 } -design gatelevel 

##################
# Input delays
##################
set_input_delay 10.000 -clock uclk_i -add_delay  -design gatelevel  {dat_i(*) fd_rxd_i fd_txer_i fd_wdgn_i rstin_i var1_acc_i var2_acc_i var3_acc_i}
set_input_delay 10.000 -clock wclk_i -add_delay  -design gatelevel  {adr_i(*) cyc_i rst_i stb_i we_i}
set_input_delay 15.000 -clock uclk_i -add_delay  -design gatelevel  {c_id_i(*) m_id_i(*)}

###################
# Output delays
###################
set_output_delay 10.000 -clock uclk_i -add_delay  -design gatelevel  {dat_o(*) fd_rstn_o fd_txck_o fd_txd_o fd_txena_o r_fcser_o r_tler_o rston_o u_cacer_o u_pacer_o var1_rdy_o var2_rdy_o var3_rdy_o}
set_output_delay 10.000 -clock wclk_i -add_delay  -design gatelevel  {ack_o}
set_output_delay 15.000 -clock uclk_i -add_delay  -design gatelevel  {s_id_o(*)}

